from .settings import BOT_NAME, WORK_START, WORK_END

WELCOME = f"""
🌟 به سامانه {BOT_NAME} خوش آمدید.

لطفاً خدمت موردنظر خود را انتخاب نمایید.
"""

OUT_OF_TIME = f"""
🕒 سامانه {BOT_NAME}

در حال حاضر خارج از ساعات پاسخگویی کارشناسان هستیم.

ساعات پاسخگویی:

شنبه تا پنجشنبه
{WORK_START}:00 تا {WORK_END}:00

لطفاً در ساعات اداری مجدداً مراجعه فرمایید.

از همراهی شما سپاسگزاریم. 🌹
"""

HOLIDAY = f"""
📢 سامانه {BOT_NAME}

امروز سامانه تعطیل است.

لطفاً در اولین روز کاری از ساعت {WORK_START}:00 تا {WORK_END}:00 مراجعه فرمایید.

از شکیبایی شما سپاسگزاریم. 🌹
"""

MAINTENANCE = f"""
🔧 سامانه {BOT_NAME}

در حال حاضر سامانه جهت به‌روزرسانی موقتاً از دسترس خارج است.

از شکیبایی شما سپاسگزاریم. 🌹
"""
