WELCOME = """
⚡ به سامانه آذرخش خوش آمدید.

لطفاً یکی از خدمات زیر را انتخاب نمایید.
"""

OUT_OF_TIME = """
🕒 ساعت پاسخگویی کارشناسان به پایان رسیده است.

در حال حاضر فقط امکان مشاهده وضعیت درخواست‌ها فعال است.

⏰ ساعات پاسخگویی:
۷:۰۰ تا ۱۳:۰۰
"""

HOLIDAY = """
📅 امروز سامانه پاسخگویی تعطیل است.

در حال حاضر فقط امکان مشاهده وضعیت درخواست‌ها فعال است.
"""

MAINTENANCE = """
⚙️ در حال حاضر سامانه جهت به‌روزرسانی موقتاً از دسترس خارج است.

از شکیبایی شما سپاسگزاریم.
"""

INVALID_IDENTIFIER = """
❌ اطلاعات وارد شده معتبر نیست.

لطفاً دوباره تلاش نمایید.
"""

INVALID_FOR_SERVICE = """
❌ این شناسه برای خدمت انتخاب‌شده قابل استفاده نیست.
"""

DUPLICATE_REQUEST = """
⚠️ برای این خدمت قبلاً درخواست ثبت شده است.

کد رهگیری:
{tracking}
"""

REQUEST_REGISTERED = """
✅ درخواست شما با موفقیت ثبت شد.

کد رهگیری:

{tracking}

لطفاً این کد را تا پایان فرآیند نزد خود نگه دارید.
"""
